Revit 2027 API
ExternalDefinitionCreationOptions Constructor
 Constructs the options using a specified name and type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDefinitionCreationOptions(
	string name,
	ForgeTypeId dataType
)
Public Sub New (
	name As String,
	dataType As ForgeTypeId
)
public:
ExternalDefinitionCreationOptions(
	String^ name,
	ForgeTypeId^ dataType
)
new :
        name : string *
        dataType : ForgeTypeId -> ExternalDefinitionCreationOptions
Parameters
name String
 The name of the parameter definition to be created.
dataType ForgeTypeId
 The identifier of either a spec or a category. A category identifier indicates a Family Type parameter of that category.
Exceptions
Exception | Condition
ArgumentException |  The given identifier is neither a spec nor a category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace